{
  "common": {
    "home": {
      "title": "Subhodeep Dey",
      "subtitle": "Full stack developer and an engineering leader. Currently working on roadmap.sh.",
      "formTitle": "Get in Touch",
      "bio1": "I am a full-stack developer with a passion for building well-crafted products",
      "bio2": "I believe in putting users first, prioritizing simplicity and functionality",
      "bio3": "I've been programming for over 15 years",
      "bio4": "I've seen trends come and go",
      "bio5": "I've tried many languages and frameworks",
      "bio6": "I value clean code",
      "bio7": "I believe in robust systems that are maintainable long-term",
      "bio8": "I thrive in high-growth, high-impact environments",
      "bio9": "I enjoy collaborative teams where everyone takes ownership",
      "bio10": "I am passionate about developer tools and growth",
      "bio11": "I love open-source",
      "bio12": "I enjoy sharing knowledge through writing and talks",
      "bio13": "Check out my",
      "bio14": "YouTube channel",
      "bio15": "for videos on developers and tech",
      "contactText": "Want to work together? Feel free to"
    },
    "navigation": {
      "home": "Home",
      "work": "Work",
      "projects": "Projects",
      "posts": "Posts",
      "sayHi": "Say Hi"
    },
    "contactForm": {
      "name": "Name",
      "email": "Email",
      "message": "Message",
      "submit": "Send Message",
      "success": "Message sent successfully!",
      "error": "Failed to send message. Please try again."
    },
    "themeSwitch": {
      "light": "Light",
      "dark": "Dark",
      "system": "System"
    },
    "languageSwitch": {
      "en": "English",
      "ko": "Korean",
      "ja": "Japanese"
    },
    "posts": {
      "title": "Blog Posts",
      "intro": "Articles, tutorials, snippets, and everything else I've written on technology, development, and more.",
      "search": "Search posts...",
      "noResults": "No posts found. Try a different search term."
    },
    "projects": {
      "title": "Projects",
      "intro": "Here are some of the projects I've been working on. Most of them are open-source and available on GitHub.",
      "visitWebsite": "Visit Website",
      "visitGitHub": "View on GitHub"
    },
    "work": {
      "title": "Work Experience",
      "intro": "I've had the pleasure of working with some amazing companies over the years. Here's a summary of my professional journey.",
      "showDetails": "Show details",
      "hideDetails": "Hide details"
    },
    "impressum": {
      "title": "Impressum",
      "description": "Legal information about this website and its owner",
      "responsible": "Responsible for Content",
      "name": "Subhodeep Dey",
      "address": "123 Tech Street, Innovation District",
      "country": "United States",
      "contact": "Contact Information",
      "email": "Email",
      "website": "Website",
      "businessRegistration": "Business Registration",
      "registrationInfo": "Registered as an independent developer and consultant",
      "vatId": "VAT Identification Number",
      "vatIdNumber": "US123456789",
      "disclaimer": "Disclaimer",
      "disclaimerContent": "Despite careful content control, we assume no liability for the content of external links. The operators of the linked pages are solely responsible for their content."
    },
    "privacy": {
      "title": "Privacy Policy",
      "description": "Information about how we collect, use, and protect your data",
      "lastUpdated": "Last Updated",
      "introduction": "Introduction",
      "introText": "This Privacy Policy explains how we collect, use, and protect your personal information when you visit our website. We respect your privacy and are committed to protecting your personal data.",
      "informationCollection": "Information Collection",
      "informationCollectionText": "We collect information from you when you subscribe to our newsletter, fill out a form, or interact with our website in other ways.",
      "personalInformation": "Personal Information",
      "personalInfoItem1": "Name and email address when you contact us",
      "personalInfoItem2": "Information you provide when subscribing to our newsletter",
      "personalInfoItem3": "Any other information you voluntarily provide",
      "nonPersonalInformation": "Non-Personal Information",
      "nonPersonalInfoText": "We may collect non-personal information about visitors such as browser type, referring site, date and time of visits, and pages viewed.",
      "cookies": "Cookies",
      "cookiesText": "Our website uses cookies to enhance your browsing experience. You can choose to disable cookies in your browser settings, but this may affect your experience on our site.",
      "dataUsage": "How We Use Your Data",
      "dataUsageText": "We use the information we collect to improve our website, respond to your inquiries, send newsletters (if you've subscribed), and provide you with a better user experience.",
      "dataProtection": "Data Protection",
      "dataProtectionText": "We implement appropriate security measures to protect your personal information from unauthorized access, alteration, disclosure, or destruction.",
      "thirdParty": "Third-Party Services",
      "thirdPartyText": "We may use third-party services such as analytics providers and email marketing platforms. These services may collect information about your use of our website.",
      "policyChanges": "Changes to This Policy",
      "policyChangesText": "We may update our Privacy Policy from time to time. We will notify you of any changes by posting the new Privacy Policy on this page.",
      "contact": "Contact Us",
      "contactText": "If you have any questions about this Privacy Policy, please contact us through the contact form on our website."
    },
    "moral": {
      "title": "Moral Code",
      "moralIntro": "This document outlines the ethical principles and values that guide my work and interactions with clients, collaborators, and the broader community.",
      "principle1Title": "Integrity and Honesty",
      "principle1Text": "I commit to maintaining the highest standards of integrity in all professional relationships. I provide honest assessments of project requirements, timelines, and capabilities, and I never misrepresent my skills or experience.",
      "principle2Title": "Quality and Excellence",
      "principle2Text": "I strive for excellence in all my work, delivering solutions that are not only functional but also maintainable, secure, and aligned with best practices. I continuously improve my skills and knowledge to provide the best possible service.",
      "principle3Title": "Respect for Privacy and Data Protection",
      "principle3Text": "I respect the privacy of users and handle all data with appropriate care. I implement robust security measures to protect sensitive information and comply with relevant data protection regulations.",
      "principle4Title": "Social Responsibility",
      "principle4Text": "I consider the broader impact of my work on society and the environment. I decline projects that could cause harm or promote discrimination, and I seek opportunities to contribute positively to the community through open-source contributions and knowledge sharing.",
      "principle5Title": "Transparency and Fairness",
      "principle5Text": "I maintain transparent communication with clients and collaborators, clearly explaining processes, decisions, and potential challenges. I practice fair business dealings and respect intellectual property rights.",
      "conclusion": "Commitment",
      "conclusionText": "This moral code is not just a statement but a commitment to ethical practice in all aspects of my professional life. I welcome feedback and hold myself accountable to these principles."
    }
  }
}
